###  통계기초 

# 평균, 중앙값, 분산, 표준편차
score <- c(85,90,93,86,82)
mean(score) #평균값
median(score) # 중앙값
var(score)  # 분산
sd(score)   # 표준편차


#### 편차 확인해 보기  
평균 <- mean(score) ;평균
result <- 0 

for(i in score){
  cat( i ,"점의 편차는", result = i - 평균,"입니다. /n")
}





#### 실습 

"""
문제 1.  
4가지의 교육 방법의 효과를 비교분석 하기위해 
학생 40명을 무작위로 10명씩 4개의 집단으로 나누고
한 학기 동안 각 교육방법으로 교육을 실시한 후에 
치른 기말 시험이 다음자료와 같다.
"""

# 각 교육방법에 따른 성적 
A <- c(65,87,73,79,81,69,80,77,68,74)
B <- c(75,69,83,81,72,79,90,88,76,82)
C <- c(59,78,67,62,83,76,55,75,49,68)
D <- c(94,89,80,88,90,85,79,93,88,85)

# 간단하게 정리 및 1차 분석 

           #  Min. 1st Qu.  Median    Mean 3rd Qu.    Max 
summary(A) #  65.00   70.00   75.50   75.30   79.75   87.00
summary(B) #  69.00   75.25   80.00   79.50   82.75   90.00  
summary(C) #  49.00   59.75   67.50   67.20   75.75   83.00
summary(D) #  79.00   85.00   88.00   87.10   89.75   94.00 

# 각각의 집단은 서로 다른 값을 보여주고 있다. 
# D 의 경우 전체적으로 값이 가장 높다는 것을 알 수 있다. 
# 추정 : 대립가설 -> 교육방법을 달리하면 성적에 영향이 있을것이다. 
# 1차로 평균, 표준편차를 통해 각 교육의 효과성을 검정가능 하지만 
# 타당성을 확보하기위해 정규분포를 진행하고자 한다.  


# 정규분포를 한번 확인해 보자 
shapiro.test(A) # W = 0.97691, p-value = 0.9465
shapiro.test(B) # W = 0.97827, p-value = 0.9553
shapiro.test(C) # W = 0.96954, p-value = 0.8865
shapiro.test(D) # W = 0.94461, p-value = 0.6054


## 정규분포 결과해석
# 각각의 p-value를 전체적으로 확인했을때 0.05보다 높다는것을 확인할 수있다. 

## 가설 설정 
# 귀무가설 : 교육방법을 달리하면 성적에 영향이 없을 것이다. 
# 귀무가설 -> 차이가 없거나 의미있는 차이가 없는 경우의 가설이며 이것이 맞거나 맞지 않다는 통계학적 증거를 통해 증명하려는 가설 
# 대립가설 : 교육방법을 달리하면 성적에 영향이 있을 것이다.  


## 검정방법 및 이유
# 3개 이상의 집단이 있기 때문에 t-검정이 아닌 One-way analysis을 진행
oneway_data <- c(A,B,C,D); oneway_data
grp <- c(rep(1,10),rep(2,10),rep(3,10),rep(4,10));grp
# One-way analysis of means
oneway.test(oneway_data~grp,var=T)  # F = 11.727, num df = 3, denom df = 36, p-value = 1.653e-05

## 결과 해석 
# 유의확률이 p-value = 1.653e-05 < 0.05 이기 때문에 귀무가설의 기각하고 대립가설을 채택한다. 
# 그렇기 때문에 교육방법을 달리하면 성적에 영향이 있을 것이다.  




"""
문제 2. 국어 성적을 올리기 위해 교육을 8명의 타자수에게 실시하여
교육 전과 후의 국어 성적을 조사하였더니 아래와 같다.
교육의 효과를 설명 할 수있는가?
"""

# 교육 전과 후의 국어 성적

Before_class <-c(52,60,63,43,46,56,62,50)  # 교육전
After_class  <-c(58,62,62,48,50,55,68,57)  # 교육후


# 간단하게 정리 및 1차 분석 

                        #  Min. 1st Qu.  Median    Mean 3rd Qu.    Max 
summary(Before_class)   #  43.0    49.0    54.0    54.0    60.5    63.0
summary(After_class)    #  48.00   53.75   57.50   57.50   62.00   68.00

# 교육전과 후를 비교해보았을때 전체적으로 성적이 향산된 것을 확인할 수 있다. 
# 추정 : 대립가설 -> 교육하면 성적에 영향이 있을것이다. 

# 평균, 표준편차를 통해 각 교육의 효과성을 검정가능하다. 
# 하지만 타당성을 확보하기위해 추가로 정규분포를 진행하고자 한다.  


## 정규성 검증
shapiro.test(Before_class) # W = 0.93924, p-value = 0.6037
shapiro.test(After_class)  # W = 0.97079, p-value = 0.9042


## 정규분포 결과해석 
# 두 p-value를 확인했을때 0.05보다 높다는것을 확인할 수있다. 


## 가설설정
# 귀무가설 : 교육하면 성적에 영향이 없을 것이다. 
# 대립가설 : 교육하면 성적에 영향이 있을 것이다.  


## 검정방법 및 이유
# 두 집단 간의 평균을 비교해야하기 때문에 -> t-검정을 사용하여 검증을 진행한다. 
# 대응 표본이기 때문에 전후를 비교하기위해 paired = T 설정해줘야 한다. 
# t.test(Before_class,After_class)               # t = -0.99422, df = 13.788, p-value = 0.3372
t.test(Before_class, After_class, paired = T)    # t = -3.1305, df = 7, p-value = 0.0166


## 결과 해석 
# 유의확률이 p-value = 0.0166 < 0.05 이기 때문에 귀무가설의 기각하고 대립가설을 채택한다. 
# 그렇기 때문에 국어 성적을 올리기위해 교육하면 성적에 영향이 있을것이다. 



"""
문제 3. 
적용 사례로 보면, 환자 10명을 상대로 성형전과 성형후 만족도를 측정하고 
이 두자료의 평균이 다르다고 할수있는지를 검증하고자 한다. 
"""

# 환자 10명의 성형전과 성형후 만족도
Before_patient  <-c(13.2, 8.2, 10.9, 14.3, 10.7, 6.6, 9.5, 10.8, 8.8, 13.3) 
After_patient   <-c(14.0, 8.8, 11.2, 14.2, 11.8, 6.4, 9.8, 11.3, 9.3, 13.6) 


# 간단하게 정리 및 1차 분석 
                          #  Min. 1st Qu.  Median    Mean 3rd Qu.    Max 
summary(Before_patient)   #  6.600   8.975  10.750  10.630  12.625  14.300
summary(After_patient)    #  6.400   9.425  11.250  11.040  13.150  14.200

# 추정 : 대립가설 -> 성형이후 환자의 만족도가 차이가 있다. 


## 정규성 검증
shapiro.test(Before_patient) # W = 0.9624, p-value = 0.8129
shapiro.test(After_patient)  # W = 0.94815, p-value = 0.6467


## 정규분포 결과해석 
# 두 p-value를 확인했을때 0.05보다 높다는것을 확인할 수있다. 


## 가설설정
# 귀무가설 : 성형이후 환자의 만족도의 차이가 없다. 
# 대립가설 : 성형이후 환자의 만족도가 차이가 있다. 


## 검정방법 및 이유
# t-검정을 사용하여 두 집단 간의 평균을 비교한다.
# 대응 표본이기 때문에 전후를 비교하기위해 paired = T 설정해줘야 한다. 
t.test(Before_patient, After_patient, paired = T)    # t = -3.3489, df = 9, p-value = 0.008539


## 결과 해석 
# 유의확률이 p-value = 0.008539 < 0.05 이기 때문에 귀무가설의 기각하고 대립가설을 채택한다. 
# 그렇기 때문에 성형전후 환자의 만족도가 차이가 있다는 것을 알 수 있다. 
# 또한 평균과 중앙값을 통해 성형후가 만족도가 좋다는것을 알수있다. 




"""
문제 4.

개발된 신약의 효과를 측정하기 위해 환자집단을 두 집단으로 나누어
한 집단은 신약을 조제하여 치료하고, 나머지 한 집단은 위약을 제공한 후 
환자들의 치료효과가 나타나는 시간을 측정하였다. 
결과는 다음과 같다. 
"""

# 두 환자집단의 치료효과가 나타나는 시간
new_medicine <-c(15,10,13,7,9,8,21,9,14,8) 
old_medicine <-c(15,14,12,8,14,7,16,10,15,12) 

# 간단하게 정리 및 1차 분석 
                          #  Min. 1st Qu.  Median    Mean 3rd Qu.    Max 
summary(new_medicine)     #  7.00    8.25    9.50   11.40   13.75   21.00
summary(old_medicine)     #  7.00   10.50   13.00   12.30   14.75   16.00

# 추정 : 대립가설 -> 치료효과가 나타나는 시간이 신약이 빠르다.


## 정규성 검증
shapiro.test(new_medicine)  # W = 0.86663, p-value = 0.09131
shapiro.test(old_medicine)  # W = 0.91249, p-value = 0.2986


## 가설설정
# 귀무가설 : 치료시간이 차이가 안난다. 
# 대립가설 : 치료시간이 차이가 난다. 


## 정규분포 결과해석 
# 두 p-value를 확인했을때 0.05보다 높다는것을 확인할 수있다. 
t.test(new_medicine, old_medicine) #t = -0.53311, df = 16.245, p-value = 0.6012


## 결과 해석 
# 유의확률이 p-value = 0.6012 > 0.05 이기 때문에 귀무가설을 채택한다. 
# 평균과 중앙값을 통해 신약이 빠를것이라고 추정하였으나 치료시간이 차이가 안난다는것을 t-검증을 알 수 있다.
# 그렇기 때문에 신약과 위약의 치료속도 차이가 안난다는것을 알수있다.  



#문제1. 
x1<-c(65,87,73,79,81,69,80,77,68,74) 
x2<-c(75,69,83,81,72,79,90,88,76,82) 
x3<-c(59,78,67,62,83,76,55,75,49,68) 
x4<-c(94,89,80,88,90,85,79,93,88,85) 

#문제2
x<-c(52,60,63,43,46,56,62,50) 
y<-c(58,62,62,48,50,55,68,57)

#문제 3.
pre<-c(13.2, 8.2, 10.9, 14.3, 10.7, 6.6, 9.5, 10.8, 8.8, 13.3) 
post <-c(14.0,8.8,11.2,14.2,11.8,6.4,9.8,11.3,9.3,13.6) 

#문제 4.
x<-c(15,10,13,7,9,8,21,9,14,8) 
y<-c(15,14,12,8,14,7,16,10,15,12) 

#문제 5.
x1<-c(23,27,24,25,29,30,26) 
x2<-c(35,32,38,36,32,33,34) 
x3<-c(36,41,38,39,40,38,39) 
x4<-c(32,30,37,34,35,34,32)

#문제 6.
x<-c(15,10,13,7,9,8,21,9,14,8) 
y<-c(15,14,12,8,14,7,16,10,15,12) 

#문제 7.
x1<-c(100,90,98,79,81,69,80,77,68,54)
x2<-c(5,4,5,3,4,3,2,3,2,1)
x3<-c(5,3,4,3,4,3,2,3,2,1) 
x4<-c(5,3,3,2,3,3,4,3,2,1) 

#문제 8.
x1<-c(100,90,98,79,81,69,80,77,68,74) 
x2<-c(5,4,4,3,4,3,4,3,2,3) 
x3<-c(4,3,3,2,3,2,3,3,2,3) 
x4<-c(5,3,3,2,3,3,4,3,2,3)

#문제 9.
a <- c(58, 49, 39, 99, 32, 88, 62, 30, 55, 65, 44, 55, 57, 53, 88, 42, 39)