# Unit_04.py
# 기본 문법 알아보기

# 0. 항상 먼저 자료형 확인 
# 1. 사칙연산 => ' 더하기( + ), 빼기 ( - ), 곱하기( \* ), 나누기( / )'    
# 2. **나눗셈 후 소수점이하르 버리는 '//'연산자 **   
#     =>'//' 는 버리는 나눗셈 => 소숫점 이하는 버림. 실수에 '//' 사용하면 '.0' 이 됨       
# 3. 나눗셈 후 나머지를 구하는 %연산자 =>나누어 떨어지지 않을 때 나머지만 구함.     
# 4. 거듭 제곱 연산자 => 2**10 >>> 1024     
# 5. 값을 정수 => int()     
# 6. 객체형의 자료형 알아내기 => type(값)     
# 7. 실수와 정수 계산 => 실수로 계산이됨 
# 8. 값을 실수로 만들 때 float()안에 넣으면 됨 

print('-'*40)

#'hello,world!' 출력
print('hello,world!')

# 세미클론 => 한줄에 여러 문장일 때 
print('Hello');print('world')